[
  {
    "date": "August 01",
    "topic": "THE BEAUTY OF THE GOSPEL",
    "memory_verse": " To wit, that God was in Christ, reconciling the world unto himself, not imputing their trespasses unto them; and hath committed unto us the word of reconciliation (2 Corinthians 5:19).",
    "body_text": "it's normal  to describe the people of the world, those who haven’t received salvation, as sinners. However, it’s important to know that they were not made sinners by their own actions but by Adam’s transgression. Romans 5:12 explains this some more; it says,    Wherefore as by one man sin entered into the world, and death by sin; and so death passed upon all men, for that all have sinned., That means all were made sinners because of Adam’s disobedience. But the beauty of the Gospel is this: Just as one man's disobedience made many sinners, so also, through the obedience of one man, Jesus Christ, many are made righteous. For as by one man's disobedience many were made sinners, so by the obedience of one shall many be made righteous, (Romans 5:19). Blessed be God! This is the Gospel we’ve been sent to preach: a Gospel of life and righteousness. Don’t try to convince people that they are sinners. Instead, let them know why they needed salvation in the first place; it was Adam’s transgression; it brought death into the world and that death was passed into everything. But thanks be unto God; our Lord Jesus Christ brought life and immortality to light through the Gospel (2 Timothy 1:10). He was made sin for us who knew no sin so that we might be made the righteousness of God in Him (2 Corinthians 5:21). 1 John 5:11 says, And this is the record, that God hath given to us eternal life, and this life is in his Son. This is the Gospel: It’s the message of life, victory and righteousness in Christ Jesus. This is the message we must proclaim to the whole world. Hallelujah!",
    "prayer": " In Christ, I have received life, victory and righteousness; I am justified in Him. Thank you, Lord, for the glorious Gospel that brings salvation and illuminates the hearts of men with the knowledge of Christ’s finished works. I walk in the fullness of life and reign in righteousness, in Jesus’ Name. Amen.",
    "further_study": "John 5:24; Romans 5:17-19; 1 Corinthians 15:21-22; 2 Corinthians 5:19-21",
    "bible_reading_plan": {
      "1_year_plan": " Romans 6:1-14 & Psalms 56-59",
      "2_year_plan": " Luke 12:22-34 & Judges 7"
    }
  },
  {
    "date": "August 02",
    "topic": "A LESSON FROM EPAPHRAS",
    "memory_verse": " Epaphras, who is one of you, a servant of Christ, saluteth you, always labouring fervently for you in prayers, that ye may stand perfect and complete in all the will of God (Colossians 4:12).",
    "body_text": "Ephaphras  wasn’t a pastor, prophet, apostle, or deacon; yet he had this remarkable testimony as one who always laboured fervently in prayers for the saints. The phrase \"labouring fervently\" is translated from the Greek word “agōnizomai,” which means to strive, struggle, or contend, particularly in the face of opposition. This is the same word used in 1 Timothy 6:12, which says, \"Fight the good fight of faith....\" It gives us an idea about prayer as a warfare, a fight. Epaphras was “fighting” in the spirit, contending for the saints to stand perfect and complete in all the will of God. This kind of prayer is intense and unwavering. It’s not about asking God for material things but standing in the gap for others, ensuring they remain firm in God's purpose for their lives. Have you ever prayed like that? Have you fought in prayers for Christians in your church, your city and your nation? You can’t be a true soul winner without this kind of dedication in prayer. It requires persistence, fervency and deep passion. This is where the evangelicals of old got the expression \"prayer warriors\" from; this kind of prayer is a battle for the souls of men. Like Epaphras, be that “warrior” in prayer who ensures that others stand perfect and complete in all the will of God. Even right now, pray earnestly for fellow Christians in your church, city, and around the world, especially those facing trials, opposition, or struggles in their walk of faith; that they may be strengthened with might by God’s Spirit in their inner man. Declare that they are rooted and established in God’s truth, unwavering in their commitment to the Gospel, and empowered to rise above every difficulty as they walk in victory, faith, and boldness. If you pray for them this way, consistently, they’ll surely stand firm and immovable, abounding in the work of the Lord. Hallelujah!",
    "prayer": " Dear Father, I pray right now for Christians around the world, especially those who are facing challenges and persecutions as a result of their faith in Christ; they stand perfect and complete in all your will, and their love for you grows stronger by the day. Their convictions remain unshaken, and they fulfil their divine destiny with joy and perseverance, in Jesus’ Name. Amen.",
    "further_study": "Colossians 4:12-13 AMPC; 1 Timothy 2:1-4; James 5:16 AMPC",
    "bible_reading_plan": {
      "1_year_plan": " Romans 6:15-7:1-6 & Psalms 60-63",
      "2_year_plan": "Luke 12:35-48 & Judges 8"
    }
  },
  {
    "date": "August 03",
    "topic": "WISDOM IS GREATER THAN INTELLIGENCE",
    "memory_verse": " For wisdom is better than rubies; and all the things that may be desired are not to be compared to it (Proverbs 8:11).",
    "body_text": "Satan and his demons are very intelligent, but they’re not wise. There’s a huge difference between intelligence and wisdom. When you're intelligent, you have a high-powered reasoning faculty. You’re smart. You can think in a flash you’re calculative and analytical, and your rain works smart. But wisdom is different.Wisdom is a revelation; it’s got nothing to do with your brain. Wisdom is insight into reality. Being born again, Christ is your wisdom: “But of him are ye in Christ Jesus, who of God is made unto us wisdom…” (1 Corinthians 1:30). You don’t function with mere human intelligence but with divine wisdom. Intelligence, at its best, is grossly limited. 1 Corinthians 2:7-8 says, “But we speak the wisdom of God in a mystery, even the hidden wisdom, which God ordained before the world unto our glory: Which none of the princes of this world knew: for had they known it, they would not have crucified the Lord of glory.” Did you see that? Satan and his princes don’t know everything. They don’t know everything about you or your future. Satan may be able to observe and interpret patterns in human behaviour, but he doesn’t have insight into realities. He doesn’t possess the ability to foresee your every move unless you reveal it to him through your words or actions. By walking in divine wisdom, you can navigate your life in a way that blindsides Satan and his demons, keeping you secure and firmly rooted in God’s purpose. So, refuse to live by the intelligence, systems, structures, and economics of this world. Choose to walk in wisdom. Meditate on the Word and listen to the Holy Spirit within you, for the Word of God is the wisdom of God, and Christ is your wisdom. Hallelujah!",
    "prayer": "Dear Father, thank you for granting me divine wisdom, insight into realities. I’m filled with the knowledge of your will in all wisdom and spiritual understanding. I walk in victory and divine insight today, in Jesus' Name. Amen",
    "further_study": " James 1:5; Colossians 1:9; 1 Corinthians 2:6-8 NKJV",
    "bible_reading_plan": {
      "1_year_plan": " Romans 7:7-25 & Psalms 64-67",
      "2_year_plan": "Luke 12:49-59 & Judges 9"
    }
  },
  {
    "date": "August 04",
    "topic": "THE GREATEST NEWS OF THE GOSPEL",
    "memory_verse": " For since by man came death, by man  came also the resurrection of the dead. For as in Adam all die, even so in Christ shall all be made alive (1 Corinthians 15:21-22).",
    "body_text": " Did you know that when Jesus died on the Cross, the whole world was on that cross with Him? Every human being was crucified in Him because He was the Saviour of the world. He took the place of every sinner, every human being who lives or has ever lived. Romans 5:12 says, “Wherefore, as by one man sin entered into the world, and death by sin; and so death passed upon all men, for that all have sinned.” Adam was the first man, and through his disobedience, sin entered the world. As a result, spiritual death, which is separation from God, passed upon all men. From Adam, sin spread to humanity, affecting everyone born into this world. But Jesus was crucified in our behalf. His crucifixion meant that every human being was crucified in Him because He took their place. That’s why we must tell everyone that their sins have already been paid for in Jesus Christ. The price was settled in His death. However, paying for sin only saved humanity from its punishment; it didn’t save man from the life of sin. Christ’s death settled the charges against you, which is vital, but it didn’t reconcile you to God. The great news of the Gospel is not just that Jesus died. Of course, His death was fundamental, but the more glorious part is His resurrection. Without the resurrection, there would be no eternal life and no righteousness. The true message of salvation is based on the resurrection of Jesus. That’s where Christianity comes from. That’s where our life is from: “Therefore we are buried with him by baptism into death: that like as Christ was raised up from the dead by the glory of the Father, even so we also should walk in newness of life” (Romans 6:4). Christianity is the celebration of the resurrection of Jesus. It’s the celebration of the life of victory, righteousness, faith, hope and love in Christ Jesus. Glory to God!",
    "prayer": " Dear Father, thank you for the glorious Gospel of Jesus Christ and the power of His resurrection. Through His death, the charges against me were settled, and through His resurrection, I have eternal life. I walk in the reality of this divine life, free from sin and its dominion. I celebrate the victory of Christ in me, living in righteousness, power, and dominion today, in Jesus' Name. Amen..",
    "further_study": " Romans 4:23-25; 2 Corinthians 5:19-21; Romans 6:3-4",
    "bible_reading_plan": {
      "1_year_plan": " Romans 8:1-17 & Psalms 68-69",
      "2_year_plan": " Luke 13:1-9 & Judges 10"
    }
  },
  {
    "date": "August 05",
    "topic": "SENT TO CHANGE LIVES",
    "memory_verse": " Go ye therefore, and teach all nations, baptizing them in the name of the Father, and of the Son, and of the Holy Ghost (Matthew 28:19).",
    "body_text": "The words of Jesus in this verse are quite profound. He commands us to \"teach all nations,\" which means to make students of the nations, to disciple them, to instruct and train them in the ways of the Kingdom. This is a divine mandate. You’re a leader, assigned to reveal the righteousness of God and show the world how to live. You’re God’s champion, sent to change lives. Hallelujah! When you received the Holy Spirit, He made you a champion. Therefore, your life is meant to be impactful and full of divine exploits. You’re a hero of the Gospel, a living witness of God’s greatness. This is your moment for protagonism. Each day, for you, should be filled with testimonies that demonstrate the power of God that’s at work in you. That’s the life of a soul winner—a thrilling adventure of divine exploits that keeps heaven’s angels captivated. The Bible declares in 1 Corinthians 4:9, \"...For we are made a spectacle unto the world, and to angels, and to men.\" Think about that; you’re a marvel to the angels. 1 Peter 1:12 says they (the angels) are delighted and desire to look into these things. They’re watching you, observing your faith-filled actions, amazed at the demonstration of God's power in your life. They marvel at the authority you exercise in Christ and the impact you make in your world. When you step out in faith, when you declare God’s Word, when you heal the sick, cast out devils, and, most importantly, when you lead someone to Christ, the angels are excited. Knowing this therefore, be purpose-driven. You’re on a divine stage, and the audience includes both men and angels. Live each day fulfilling God’s call on your life.",
    "prayer": " Dear Father, I embrace my divine calling to live a life full of exploits and supernatural manifestations. Today is filled with testimonies that excite heaven. I’m a spectacle to the angels, demonstrating your power and righteousness to my world. Thank you for making my life a wonder and an inspiration, in Jesus’ Name. Amen.",
    "further_study": " Ephesians 3:10 NIV; Luke 15:10 NIV; Daniel 12:3; Matthew 5:14-16",
    "bible_reading_plan": {
      "1_year_plan": " Romans 8:18-39 & Psalms 70-73",
      "2_year_plan": " Luke 13:10-21 & Judges 11"
    }
  },
  {
    "date": "August 06",
    "topic": "FOCUS ON THOSE WHO EMBRACE YOUR MESSAGE",
    "memory_verse": "I say then, Have they stumbled that they should fall? God forbid: but rather through their fall salvation is come unto the Gentiles, for to provoke them to jealousy (Romans 11:11).",
    "body_text": "In winning souls, you’ll surely encounter some people who’d be hostile and reject your message or invitation for them to come to church. Whenever that happens, don’t be discouraged. If they reject your message and your invitation, focus on reaching other people. Shift your focus to those who embrace your message. Consider how God dealt with the world. Jesus first took the message to the Jews because they were His people. He came from among them and brought them the message of the Kingdom, but they rejected Him. John 1:11 (NIV) says, \"He came to that which was his own, but his own did not receive him.\" So, what did He do? He took the message to the Gentiles and to the whole world, and to this day, many are still receiving it. Praise God! The same happened with the apostle Paul. He had previously persecuted those who believed in Jesus Christ, standing against the Gospel. When he gave his heart to the Lord, many of his fellow Jews wouldn’t listen to him. He was once their companion but when he became a Christian, they rejected him. Straightaway, Paul turned his attention to the Gentiles who happened to be the ones the Lord had originally sent him to (read Acts 26:16-18). Also, Acts 13 tells us about Paul and Barnabas's missionary efforts in Antioch in Pisidia. They were initially welcomed in the synagogue, but later on, they faced strong opposition from jealous Jewish leaders. In response to their rejection, they boldly said, “...It was necessary that the word of God should first have been spoken to you: but seeing ye put it from you, and judge yourselves unworthy of everlasting life, lo, we turn to the Gentiles\" (Acts 13:46). You must never allow those who reject your message to determine the condition of your spirit or dampen your enthusiasm. Pray for them, intercede for them, but don’t let their rejection dissipate your passion to keep reaching others with the Gospel. As you succeed in winning others, one day, they’ll be provoked and inspired to believe, just as the Bible says the Jews would be provoked by the salvation of the Gentiles and as a nation, they'll eventually believe in Jesus Christ. Stay focused; keep reaching out, and trust in the power of the Gospel.",
    "prayer": " I fix my gaze on God's calling and continue to reach out with the Gospel, knowing that it’s the power of God unto salvation to them that believe. By His grace and the power of the Holy Spirit, I’m leading many to righteousness, and their hearts are turned to Christ. I’m indeed a light to the world. Hallelujah!",
    "further_study": " Acts 13:45-46; Matthew 10:5-15 NIV",
    "bible_reading_plan": {
      "1_year_plan": " Romans 9:1-29 & Psalms 74-77",
      "2_year_plan": " Luke 13:22-30 & Judges 12"
    }
  },
  {
    "date": "August 07",
    "topic": "THE GOSPEL TRANSFORMS LIVES",
    "memory_verse": "For I am not ashamed of the gospel of Christ: for it is the power of God unto salvation to every one that believeth… (Romans 1:16).",
    "body_text": " When the Gospel of Jesus Christ is ministered and people truly believe, it produces a transformation in their lives. If, for example, someone who’s been wayward genuinely receives the Gospel, that’ll be the end of the wayward lifestyle. However, there’s the renewing of the mind that must take place.   The same goes for someone who was a thief but has received Christ. The person will be transformed. Ephesians 4:28 says, “Let him that stole steal no more: but rather let him labour, working with his hands the thing which is good, that he may have to give to him that needeth.” Likewise, if a lady used to engage in prostitution but she is now born again, her body becomes the temple of the Holy Spirit, meaning she can’t continue in that life because she now belongs to God and must glorify God in her body and in her spirit. She must ow find a decent job as we read in Ephesians 4:28. She has to work with her hands that which is good, because prostitution is not good.  Furthermore, such people must be reminded of what happened when they gave their lives to Christ; they were washed, sanctified, and justified in the Name of the Lord Jesus, and by the Spirit of our God (1 Corinthians 6:11). This is why it’s important to preach the true Gospel: it brings people out of darkness into light, into the liberty of the sons of God. It changes people. It lifts them. It delivers them. So, they need to constantly be reminded of this and be taught and encouraged to study the Word of God for themselves and listen to messages that’ll further inform, enlighten and educate their spirits about righteousness and their new life in Christ.",
    "prayer": "Dear Father, thank you for the power of the Gospel that transforms lives and delivers men and women from darkness into your marvellous light. As many hear your Word today, they’re established in the truth and in the liberty of the Spirit, in Jesus' Name. Amen.",
    "further_study": "Romans 12:1; Ephesians 5:8; 2 Corinthians 6:17-18; Colossians 3:16",
    "bible_reading_plan": {
      "1_year_plan": "Romans 9:30-10:1-21 & Psalms 78",
      "2_year_plan": "Luke 13:31-35 & Judges 13-14"
    }
  },
  {
    "date": "August 08",
    "topic": "OUR OPPORTUNITY IS NOW",
    "memory_verse": "All of us must quickly carry out the tasks assigned us by the one who sent me, because there is little time left before the night falls and all work comes to an end (John 9:4 NLT).",
    "body_text": "There are christians who mistakenly believe they will have more opportunities to serve the lord after the rapture, but this notion is incorrect. According to the Scriptures, the Millennial Kingdom, or the 1,000 years of peace, is not primarily about us. It’s a period ordained by God for Israel. God promised them that time of peace, and they’ll indeed receive it. The Jewish calendar, suspended for 2,000 years, will resume for a final seven-year period leading into the Millennial reign. Following this, Jesus will return from heaven and set up His headquarters in Jerusalem, reigning not only as King of the Jews, but as King over the entire world. David will also return to reign over Israel, while Jesus reigns over the world. We’ll be with Jesus, reigning with Him, ensuring everything runs smoothly. So, our ministry does not operate during the millennium; instead, our service at that time would be to the Lord Jesus Christ. Our role throughout the millennium will be to perform angelic duties. The ministers during the Millennial Kingdom will predominantly be the Jews who’d be fulfilling prophecies and promises made to their nation, much as we have done over the past 2,000 years. While with Jesus, carrying out angelic functions, it’ll be a magnificent time in preparation for the great judgment, where we would even judge angels. Afterwards, we will move into the holy city and inhabit the new earth. Glory be to God! This is why we must attach a sense of urgency and responsibility to fulfilling our calling here on earth. This is our window of opportunity to carry out our divine ministry. After the trumpet sounds and we're caught up from here to meet the Lord in the air as the Bible reveals in 1 Thessalonians 4:16-17, the earthly opportunities for ministry and service will come to an end. I urge you today to be diligent and faithful in fulfilling your purpose and calling while you still have the opportunity. Think like Paul the apostle, who said, “If I proclaim the Message, it's not to get something out of it for myself. I'm compelled to do it, and doomed if I don't” (1 Corinthians 9:16 MSG). Prioritize your spiritual assignments, knowing that your actions today carry eternal significance and rewards.",
    "prayer": " Dear Father, thank you for your grace at work in me to be diligent and faithful in leading souls to Christ. I’m convinced that the Gospel is the power of God unto salvation; therefore, I’m committed to its spread around the world, taking advantage of the opportunity available now, in Jesus’ Name. Amen",
    "further_study": "1 Thessalonians 4:16-17; 1 Corinthians 3:8",
    "bible_reading_plan": {
      "1_year_plan": "Romans 11:1-24 & Psalms 79-81",
      "2_year_plan": "Luke 14:1-14 & Judges 15-16"
    }
  },
  {
    "date": "August 09",
    "topic": "BLASPHEMY AGAINST THE HOLY SPIRIT",
    "memory_verse": " Verily I say unto you, All sins shall be forgiven unto the sons of men, and blasphemies wherewith soever they shall blaspheme: But he that shall blaspheme against the Holy Ghost hath never forgiveness, but is in danger of eternal damnation (Mark 3:28-29).",
    "body_text": "Some have asked, “God is love, and He forgives all our sins, how come He says anyone who sins against the Holy Spirit will never be forgiven?” First, understand that the Lord Jesus addressed this warning to the Jews; they were the ones to whom the covenants and the Law were given. The Spirit of God had been revealed to them, and they had seen His works throughout the Old Testament. They were aware of the Holy Spirit’s role in creation, how He moved upon the waters in Genesis, and how He garnished the heavens. But despite this knowledge, when they saw Jesus perform miracles by the power of the Holy Spirit, they accused Him of working by the power of Beelzebub. Therefore, the Master warned them that blasphemy against the Holy Spirit would not be forgiven. The Holy Spirit is the One who leads a person into salvation, convicts the world of sin, righteousness, and judgement, and teaches and guides God’s people into all truth. Without the Holy Spirit, no one can come to God or believe in Him. Therefore, if someone blasphemes the Holy Spirit, they reject the very One who is meant to guide and lead them in the things of God.    To blaspheme the Holy Spirit requires a deep knowledge of God’s Word and the things of the Spirit. It takes someone who knows who the Holy Spirit is to sin against the Holy Spirit. That’s why it’s rare to find someone who's been a true Christian sin against the Holy Spirit. It’s very rare because to do that is to intentionally disdain the Spirit of grace. The Bible explains this further in Hebrews 10:28-29: \"He that despised Moses' law died without mercy under two or three witnesses: Of how much sorer punishment, suppose ye, shall he be thought worthy, who hath trodden under foot the Son of God, and hath counted the blood of the covenant, wherewith he was sanctified, an unholy thing, and hath done despite unto the Spirit of grace?\" It further shows that it’s not just any person who can do this but one with full knowledge of the truth, yet chooses to despise and disparage the Spirit of Truth.",
    "prayer": " Dear Father, thank you for the precious Holy Spirit who convicts, teaches and guides me into all truth. I acknowledge and honour His work in my life and around the world, yielding myself fully to His guidance and blessings. I walk in wisdom and understanding, continually growing in the knowledge of your Word, in Jesus' Name. Amen.",
    "further_study": " Hebrews 6:4-6; Matthew 12:31-32; John 16:8-11",
    "bible_reading_plan": {
      "1_year_plan": "Romans 11:25-36 & Psalms 82-84",
      "2_year_plan": "Luke 14:15-24 & Judges 17"
    }
  },
  {
    "date": "August 10",
    "topic": "BAPTISM—A TESTIMONY OF YOUR FAITH IN CHRIST",
    "memory_verse": "That if thou shalt confess with thy mouth the Lord Jesus, and shalt believe in thine heart that God hath raised him from the dead, thou shalt be saved (Romans 10:9).",
    "body_text": "Some have asked if water baptism is enough to save a sinner. But from the Scriptures, it’s clear that salvation comes by believing in Jesus Christ and confessing Him as Lord. Water baptism, while significant, doesn’t provide the remission of sins, but it’s a testimony of one's faith in Christ. In 1 Peter 3:21 for example, the Bible talks about water baptism, not as the removal of the filth of the flesh but as the answer of a good conscience toward God: “The like f igure whereunto even baptism doth also now save us (not the putting away of the filth of the flesh, but the answer of a good conscience toward God,) by the resurrection of Jesus Christ” (1 Peter 3:21). The real cleansing from sin comes through the blood of Jesus Christ. Baptism is a public testimony of faith in what happened to Jesus—His death, burial, and resurrection.When people are baptized in water, they symbolically identify with Christ’s death as they are immersed in water, and with His resurrection as they are brought out of the same water. This signifies their faith in the death, burial and resurrection of Jesus Christ. Water baptism, in itself, doesn’t bring salvation. A person can be baptized and still be lost if they have not been born again. The Bible makes it clear that salvation comes through faith in the death, burial and resurrection of Jesus Christ. Baptism is an outward expression of that faith",
    "prayer": " Dear Father, I thank you for the gift of salvation through the precious blood of Jesus Christ. I declare my faith in His death, burial and resurrection, and I live in the consciousness of this glorious truth. My life is a testimony of my union with Christ, and I walk daily in the victory of His resurrection, in Jesus’ Name. Amen.",
    "further_study": " Romans 6:3-4; Colossians 2:11-12; Acts 2:38",
    "bible_reading_plan": {
      "1_year_plan": "Romans 12:1-16 & Psalms 85-88",
      "2_year_plan": " Luke 14:25-35 & Judges 18"
    }
  },
  {
    "date": "August 11",
    "topic": "LOVE SEES AND APPRECIATES TRUE VALUE",
    "memory_verse": " He that loveth not knoweth not God; for God is love (1 John 4:8).",
    "body_text": "Some people interpret love according to feelings, emotions or outward appearance. But true love isn’t defined by human emotions or affections because love is the nature of God. Therefore, it’s only when you see through the eyes of God that you can truly recognize and appreciate the true value of others.  That was what happened when God gave Jesus for the salvation of humanity. He saw our true value. The Bible says, “For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life” (John 3:16). He didn’t love the world of things, buildings, or nature; He loved the world of men despite their unbelief, mockery and wickedness. No wonder the Bible says in Romans 5:8, “But God commendeth his love toward us, in that, while we were yet sinners, Christ died for us.” The Bible says “…God was reconciling the world to himself in Christ, not counting men’s sins against them...” (2 Corinthians 265:19 NIV). That’s the same life and nature He’s given you; you’re to love others in spite of what they do or how they look. See and appreciate their true value. That’s what Jesus saw, and that’s what He’s raising us to understand and apply. If God would love the sinner so much, how much more should we love those who are in Christ with us? That’s why He says, \"A new command I give you: Love one another. As I have loved you, so you must love one another\" (John 13:34 NIV). He didn’t say \"Love one another, as long as they’re lovable.\" You’re to love even those who don’t reciprocate your love. Their rejection shouldn’t stop your love. This is the God-kind of love; it’s unconditional. It sees and appreciates the true value of others.",
    "prayer": " Dear Father, thank you for your love that sees beyond outward appearances and actions. I see the true value of people, and I love them the way you do. I walk in this divine love, extending grace and kindness to all, just as you have loved me. Thank you for teaching me to love like you and bring many to the knowledge of your truth, in Jesus' Name. Amen.",
    "further_study": " 1 John 4:7-11; John 15:12; Ephesians 2:4-5",
    "bible_reading_plan": {
      "1_year_plan": "Romans 12:17-13:1-14 & Psalms 89",
      "2_year_plan": "Luke 15:1-10 & Judges 19"
    }
  },
  {
    "date": "August 12",
    "topic": "CHRIST IN YOUR SPIRIT, SOUL AND BODY",
    "memory_verse": "To whom God would make known what is the riches of the glory of this mystery among the Gentiles; which is Christ in you, the hope of glory (Colossians 1:27).",
    "body_text": "The greatest thing that could ever happen to a person is to receive and know Jesus Christ. His Word and indwelling presence give your life a meaning and establish your victory over sin, sickness and the devil. Man is a spirit, he has a soul and he lives in a body. When you were born again, Christ took up His abode in your spirit. However, His manifestation in your life must go beyond your spirit and impact your soul, mind and body. A person can be born again and still struggle with negative thoughts or be oppressed of the devil. This is because the soul, which comprises the mind, emotions and will, must also be subjected to the influence of Christ. When Christ is manifested in your soul, your thoughts are renewed to align with God’s Word. Instead of thinking fear, failure, or defeat, you think faith, success, victory, dominion and righteousness. You feel the emotions of God and act according to His will. This is why the Bible admonishes in Romans 12:2 for us to renew our minds. In John 14:21, the Lord Jesus said, \"… he that loveth me shall be loved of my Father, and I will love him, and will manifest myself to him.\" This means Jesus can manifest Himself to you, not just in your spirit but also in your mind, filling you with divine thoughts. If you’re sick in your body today for example, what you need is the manifestation of Christ in your body! It’ll keep you in divine health. His manifestation in your life dispels everything that is not of God. If Christ is manifested in the limbs of one who’s impotent, they’ll be made whole. If He’s manifested in your heart, you’ll never have heart trouble. Hallelujah! Christ manifested in the lives of sinners breaks the power of sin and shatters the chains of bondage for them to serve God in righteousness. So, let Christ be fully expressed in every part of your being—your spirit, soul and body—so that you may walk in the fullness of His glory. It begins with you being conscious of the Christ-life in you and living every second, every minute and every hour of each day with the understanding that Christ in you is the hope of glory.",
    "prayer": " Dear Father, thank you for the indwelling presence of Christ in me. His life, power and glory are manifested in my spirit, soul and body. Every sickness, oppression, and limitation is dispelled as Christ is revealed in my life. I walk in divine health, righteousness and victory, expressing your glory, in Jesus' Name. Amen.",
    "further_study": " Romans 8:10-11; John 10:10; 2 Corinthians 4:6-7; Colossians 1:26-27",
    "bible_reading_plan": {
      "1_year_plan": "Romans 14-15:1-4 & Psalms 90-93",
      "2_year_plan": "Luke 15:11-19 & Judges 20"
    }
  },
  {
    "date": "August 13",
    "topic": "WE BUILD CAPACITY WHILE DOING THE WORK",
    "memory_verse": " Say not ye, There are yet four months, and then cometh harvest? behold, I say unto you, Lift up your eyes, and look on the fields; for they are white already to harvest (John 4:35).",
    "body_text": " Some people think that before you can become effective in soul winning, you must first withdraw into isolation to build capacity. But the truth is, when it comes to soul winning, we build capacity while doing the work. The Lord didn’t say “Build capacity first, then go into all the world and preach the Gospel to every creature”; no! Rather, He said straight on, “…Go ye into all the world, and preach the gospel to every creature” (Mark 16:15). Also in Matthew 28:19, He said, “Go ye therefore, and teach all nations....” He didn’t say build capacity first. That’s because you already have the Holy Spirit who is the real capacity builder. With Him living inside you, you have the required capacity for effective evangelism. He came into you to make you an effective soul winner: “But ye shall receive power, after that the Holy Ghost is come upon you: and ye shall be witnesses unto me both in Jerusalem, and in all Judaea, and in Samaria, 30and unto the uttermost part of the earth” (Acts 1:8). Soul winning isn’t something for which you need another “extraordinary” preparation before you begin. 2 Corinthians 3:5-6 says, “Not that we are sufficient of ourselves to think anything as of ourselves; but our sufficiency is of God; Who also hath made us able ministers of the new testament….” Think about that! The Holy Spirit has already made you an able minister of the New Testament. He’s already built your capacity; all you have to do is launch out. The more you win souls the more He increases His grace upon you to do more. So, build greater capacity as you do the work. This is how we grow in faith and develop greater effectiveness in ministry. Take time always to fast, pray, and study the Word; all these will fuel your passion for soul winning and evangelism. Let the Master return to f ind you diligently working, spreading the message of the Kingdom everywhere.",
    "prayer": " Dear Father, thank you for the wisdom and urgency of the Gospel. I declare that as I win souls, I am strengthened and equipped for greater works. I build capacity as I labour in the Gospel, and I am effective in fulfilling your call. Thank you for making me a fruitful labourer in your Kingdom, in Jesus’ Name. Amen.",
    "further_study": "Matthew 28:19-20; 2 Timothy 4:2; 2 Corinthians 3:5-6 AMPC; Acts 1:8 AMPC",
    "bible_reading_plan": {
      "1_year_plan": "Romans 15:5-13 & Psalms 94-98",
      "2_year_plan": "Luke 15:20-32 & Judges 21"
    }
  },
  {
    "date": "August 14",
    "topic": "IT’S NOT A MATTER OF CONVENIENCE",
    "memory_verse": " Not forsaking the assembling of ourselves together, as the manner of some is; but exhorting one another: and so much the more, as ye see the day approaching (Hebrews 10:25).",
    "body_text": " The Bible strongly enjoins that we take our physical presence, our onsite attendance in church services, very seriously. Those who don’t heed this admonition are in error and not to be emulated. Many have become so used to participating in services online and have lost sight of the original purpose of online church meetings; they’re not meant to replace your physical presence in the church at the times you’re supposed to be there.  The provision of online platforms for church services was never intended to be a matter of convenience but a necessity for those who, due to circumstances that may be beyond their immediate control, are unable to attend in person. It is not meant for those who simply do not “feel” like going to church but for those who truly can’t for one reason or the other. Therefore, whenever you’re able to be physically present in church, you must go. If you travel out of the location where your home church is, perhaps for business or for other reasons and there’s no church in the town or city you travelled to, then it’s understandable to join your 32home church service online. But if there’s a branch of your church there, you should go and introduce yourself and join the Christians there in fellowship. Pastors should encourage their members to attend the church in the city they travel to rather than simply logging in online. Telling members to only connect online when a local church is available is not the right approach. If the nearest church is too far, that is understandable. But even in such cases, we should be proactive in establishing new churches. Many new branches for many churches began because members, upon finding no existing branch of their church in a city they travelled to, started one. The next time they or others visited that location, a church was now in place. We must not become complacent and turn the online solution into a tool of convenience. The gathering of Christians in fellowship is vital, and whenever possible, every Christian should be physically present in church.",
    "prayer": " I refuse to neglect the assembling of myself with other Christians, knowing that in our gathering, there is an impartation of grace, strength and wisdom. I walk in wisdom, and as I honour the structure and order the Lord has set in His Church, there are increased manifestations of God’s blessings in my life, in Jesus' Name. Amen.",
    "further_study": " Hebrews 10:25 CEV; Acts 2:42; Psalm 122:1; Matthew 18:20",
    "bible_reading_plan": {
      "1_year_plan": "Romans 15:14-33 & Psalms 99-101",
      "2_year_plan": " Luke 16:1-12 & Ruth 1-2"
    }
  },
  {
    "date": "August 15",
    "topic": "UNLIMITED AUTHORITY",
    "memory_verse": " And whatsoever ye shall ask in my name, that will I do, that the Father may be glorified in the Son (John 14:13).",
    "body_text": " There’re no limits to what we can do in the Name of Jesus. Our potentials, abilities, strength, wisdom, dominion and might are infinite because we represent Him. We live in His Name. We can do anything and all things in His Name. This is one reason you must be bold, tough, and never act like a victim; in Christ, you’re more than a conqueror. Read again what the Lord Jesus said in our opening scripture: “And whatsoever ye shall ask in my name, that will I do, that the Father may be glorified in the Son.” Only the Name of Jesus wields unlimited authority, power that changes hopeless situations and makes all things possible. What a Name! No wonder the Bible says, “Wherefore God also hath highly exalted him, and given him a name which is above every name: That at the name of Jesus every knee should bow, of things in heaven, and things in earth, and things under the earth; And that every tongue should confess that Jesus Christ is Lord, to the glory of God the Father” (Philippians 2:9-11). Then in Mark 16:17-18, the Lord Himself said, \"And these signs 34shall follow them that believe; In my name shall they cast out devils; they shall speak with new tongues; They shall take up serpents; and if they drink any deadly thing, it shall not hurt them; they shall lay hands on the sick, and they shall recover.” This is absolutely glorious because it means it doesn’t matter what the case is, you can have a miracle, a testimony, in His Name. Now you can understand why Peter could boldly address a man who was impotent in his feet and commanded him to stand up in the Name of Jesus and the crippled limbs received strength (read Acts 3:1-8). The devil could not stop it. The man leaped and walked; how? In the Name of Jesus! That Name is above every name, and in that Name, you have authority over all things. Therefore, reign and exercise dominion in this world. Praise God!",
    "prayer": " Dear Father, thank you for the power in the Name of Jesus by which I reign and exercise dominion in this world. In His Name, I cast out devils, heal the sick and walk in victory. Nothing is impossible unto me because I function in the authority of that glorious Name. Thank you for the privilege to use the Name of Jesus and to live triumphantly today. Amen.",
    "further_study": "Acts 3:1-8; Mark 16:17; Philippians 2:9-11 MSG",
    "bible_reading_plan": {
      "1_year_plan": "Romans 16:1-27 & Psalms 102-103",
      "2_year_plan": "Luke 16:13-18 & Ruth 3-4"
    }
  },
  {
    "date": "August 16",
    "topic": "ACT ON HIS WORD WITHOUT HESITATION",
    "memory_verse": " His mother saith unto the servants, Whatsoever he saith unto you, do it (John 2:5).",
    "body_text": "In John 2:1-11, the Bible tells a remarkable story of the first recorded miracle of the Lord Jesus which took place at a wedding in Cana of Galilee. As the celebration was in full swing, they ran out of wine, a situation that could have been embarrassing for the hosts. Mary, the mother of Jesus, turned to Him for a solution. Even though the Master said to Mary that His hour had not yet come, Mary gave the servants a profound admonition of faith. She said, “...Whatsoever He saith unto you, do it” (John 2:5). The Lord Jesus then told the servants to fill six large waterpots with water. Without question, they obeyed, filling them to the brim. Then the Master said, “...Draw out now, and bear unto the governor of the feast...” (John 2:8). Again, without hesitation, they followed His instruction. As the governor tasted it, he marvelled at the exquisite taste of the fine wine, not knowing where it had come from. What was once ordinary water had been turned into the finest wine. This shows the importance of acting on ACT ON HIS WORD WITHOUT HESITATION His mother saith unto the servants, Whatsoever he saith unto you, do it (John 2:5).God’s Word. Another striking example is seen in Matthew 17 where the Lord Jesus instructed Peter to go to the sea, cast a hook, and take the first fish that came up. He told Peter that in its mouth, he’d find a coin that would be enough to pay the tribute the tax collectors had asked for. Peter didn’t say “Master, that’s impossible.” Rather, without doubting or questioning the logic of such an instruction, he simply acted in faith. And just as the Master had said, there was a coin in the mouth of the first fish Peter caught. Always act your faith in the Word of God. Don’t try to rationalize divine instructions. God’s Word transcends logic, science, and technology. When the Lord speaks, His Word is final; act on it without hesitation. In His words and instructions lie your miracle, your testimony, your provision, peace, joy and victory. Hallelujah!",
    "prayer": " Dear Father, thank you for the power of your Word. I choose to act on your instructions without hesitation, knowing that therein lies my miracle, testimony, provision, transformation and blessings. My faith is steadfast in you, and I absolutely trust in you and your unfailing Word, now and always, in Jesus’ Name. Amen.",
    "further_study": " John 2:7-11; Luke 5:5-6; Isaiah 55:10-11",
    "bible_reading_plan": {
      "1_year_plan": "1 Corinthians 1 & Psalms 104-106",
      "2_year_plan": "Luke 16:19-31 & 1 Samuel 1"
    }
  },
  {
    "date": "August 17",
    "topic": " PERSIST IN PRAYER",
    "memory_verse": "Pray without ceasing (1 Thessalonians 5:17).",
    "body_text": " Prayer is part of our priestly service or ministry as Christians. Therefore, you must be a man or woman of prayer. You must be persistent in prayer. This is sacrosanct. Certain things will not change until you pray, and that’s because of the power and effects of prayer. Revelation 5:8 reveals something powerful about our prayers. It says, “…the four beasts and four and twenty elders fell down before the Lamb, having every one of them harps, and golden vials full of odours, which are the prayers of saints.” In the Old Testament, the Lord gave instructions to the priest to burn incense morning and evening in the Tabernacle. But the Bible says all that was a shadow of things to come (Hebrews 10:1). Many years later, the apostle John, by the Spirit, sees into the heavens and is shown this amazing truth: “… golden vials full of odours, which are the prayers of saints.” When you pray in the earth, it goes before the Lord as incense. King David had a revelation of this; the Lord had guided him to understand that our prayers are actually set before God as incense. So he said in Psalms 141:2, “Let my prayer be set forth before thee as incense….” Your intercessory prayers go up to God, topple the plans of the enemy and change things in the heavenly realm, resulting in positive changes in the earth. That’s 38why you should always pray. Our opening verse says, “Pray without ceasing.” Take prayer seriously and you’ll be amazed at the changes in your life and the greater influence and impact of the Holy Spirit in and around you. Whenever possible, separate yourself from everything else and pray. Speak in tongues at every opportunity you get. And if for some reason you miss your scheduled time of prayer, make sure you pray soon afterwards. James 5:16 AMPC says, “…The earnest (heartfelt, continued) prayer of a righteous man makes tremendous power available [dynamic in its working].” So, pray and persist in prayer. Don’t say, “I prayed yesterday; that should take me through the whole week”; no! The injunction is for us to pray without ceasing. The stakes are much higher than ever. Therefore, we must persist in prayer until the last soul that must be won is reached and brought into the Kingdom before the rapture of the Church.",
    "prayer": " Dear Father, thank you for the privilege and power of prayer through which my spirit is aligned with your perfect will to walk in ever-increasing glory. My life is orchestrated by your Spirit, and I’m continually strengthened, guided and positioned for success. No situation is beyond me because I operate from a place of victory and triumph always, in Jesus’ Name. Amen.",
    "further_study": "Luke 18:1; Colossians 4:2; Acts 1:13-14",
    "bible_reading_plan": {
      "1_year_plan": "1 Corinthians 2 & Psalms 107-108",
      "2_year_plan": "Luke 17:1-10 & 1 Samuel 2"
    }
  },
  {
    "date": "August 18",
    "topic": "IN HIM YOU LIVE",
    "memory_verse": "And as Moses lifted up the serpent in the wilderness, even so must the Son of man be lifted up (John 3:14).",
    "body_text": " The Bible tells us in Numbers 21 how the children of Israel, as a result of their rebellion and unbelief, were bitten by venomous serpents and many of them died. As a result, they came to Moses and pleaded with him to pray to the Lord to take away the serpents. Moses prayed for the people, and God instructed him to make a fiery serpent of bronze and set it on a pole. He told Moses that anyone who had been bitten could look at the bronze serpent to be healed. Moses obeyed God's command, fashioned the bronze serpent, and raised it on the pole. Whenever anyone who had been bitten by a snake looked at the bronze serpent, they lived. All they had to do was “look” and they lived. In John 3:14, Jesus drew a parallel between the bronze serpent that Moses lifted in the wilderness and His own crucifixion. Just as the Israelites were healed from venomous snake bites by looking at the bronze serpent, He indicated that He had to be lifted up on the cross so that all who believed in Him would receive eternal life: “And as Moses lifted up the serpent in the wilderness, even 40so must the Son of Man be lifted up” (John 3:14 NKJV). The old songwriter, William A. Ogden, captured this truth in the hymn: “Look and live.” Look at Jesus on the Cross taking your place, taking away your sorrow, pain, disappointment, sickness and failure. But beyond the Cross, see that He lives and because He lives, you live. In Him, you have eternal life—the organic and existential attributes of divinity. The apostle John, by the Spirit, referring to the Lord Jesus, said, “the life was manifested, and we have seen, and bear witness, and declare to you that eternal life which was with the Father and was manifested to us” (1 John 1:2 NKJV). No wonder the Bible says in Acts 17:28, “For in Him we live and move and have our being….” 1 John 5:11-12 NKJV, “And this is the testimony: that God has given us eternal life, and this life is in His Son. He who has the Son has life….” In Him you have life. Blessed be God!",
    "prayer": " Dear Father, thank you for in Christ I live and move and have my being. I fix my gaze on Jesus, the author and f inisher of my faith. I walk in the reality of His finished work—triumphing over sickness, failure and death. I have eternal life, and I walk in strength and victory today, in Jesus' Name. Amen.",
    "further_study": "Numbers 21:8-9; Isaiah 45:22; 1 John 5:11-13 NKJV",
    "bible_reading_plan": {
      "1_year_plan": "1 Corinthians 3 & Psalms 109-112",
      "2_year_plan": "Luke 17:11-19 & 1 Samuel 3"
    }
  },
  {
    "date": "August 19",
    "topic": "THE GOSPEL SHOULD BE YOUR PRIMARY FOCUS",
    "memory_verse": " But seek ye first the kingdom of God, and his righteousness; and all these things shall be added unto you (Matthew 6:33)",
    "body_text": "The Gospel is God’s number one priority. It’s the most important thing to Him because therein, that is, through the Gospel, is the righteousness of God revealed (Romans 1:17). He brought life and immortality to light through the Gospel (2 Timothy 1:10). The Bible says, \"For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life\" (John 3:16). God sent Jesus to die for the sins of the world so that believing in Him, they might have life. Nothing is more important than that. This is why you must make the Gospel your priority. Preach it everywhere with the fervency and passion of the Spirit. Your life, and everything about you, also becomes Heaven’s focus when the Gospel becomes your priority. Your home becomes God's headquarters, His centre of operation, with angels constantly moving in and out, carrying out divine assignments. Make the Gospel your primary focus, and you’ll THE GOSPEL SHOULD BE YOUR PRIMARY FOCUS But seek ye first the kingdom of God, and his righteousness; and all these things shall be added unto you (Matthew 6:33).always walk in divine provisions. The moment you desire something, Heaven makes it available. Why? Because the angels are under strict instructions to ensure everything you require is supplied, just like the psalmist wrote, “The Lord is my shepherd; I shall not want\" (Psalm 23:1). Furthermore, when the Gospel is your focus, God’s holy angels work with you to dismantle oppositions and keep the enemy subdued. The Bible says, “There shall no evil befall thee, neither shall any plague come nigh thy dwelling. For he shall give his angels charge over thee, to keep thee in all thy ways” (Psalm 91:10-11). This is the life of a soul winner; God’s angels are always at work in your behalf, pushing the right buttons, and making sure things are working in your favour. Hallelujah!",
    "prayer": " The Gospel is my number one priority, and I preach it everywhere with the passion and fervency of the Spirit. As a result, angels are at work for me and around me, ensuring that all I require is supplied. I walk in victory, knowing that no weapon formed against me shall prosper. I function with divine wisdom and grace, advancing the Lord's Kingdom in the earth, in Jesus’ Name. Amen.",
    "further_study": " 1 Corinthians 9:16; 2 Corinthians 5:18-19; Mark 16:15-16",
    "bible_reading_plan": {
      "1_year_plan": "1 Corinthians 4 & Psalms 113-116",
      "2_year_plan": " Luke 17:20-30 & 1 Samuel 4"
    }
  },
  {
    "date": "August 20",
    "topic": "NOTHING CAN STOP US",
    "memory_verse": "And Paul dwelt two whole years in his own hired house, and received all that came in unto him, Preaching the kingdom of God, and teaching those things which concern the Lord Jesus Christ, with all confidence, no man forbidding him (Acts 28:30-31).",
    "body_text": "There are those who have set themselves against the Church and the Gospel of Jesus Christ. These are people with the antichrist spirit. They strategize to silence God’s truth and hinder those who boldly proclaim it. But we can’t be quiet. Necessity is laid upon us to preach the Gospel (1 Corinthians 9:16). The Gospel is too precious, and the joy too overwhelming, to keep to ourselves. It makes no difference the rage of the enemy; no amount of obnoxious laws, threats, systems or evil structures can deter us or suppress the truth. They lack the power to stop the advancement of God's Kingdom. It brings to mind the words of the psalmist: “Why do the heathen rage, and the people imagine a vain thing? The kings of the earth set themselves, and the rulers take counsel together, against the LORD, and against his anointed, saying, Let us break their bands asunder, and cast away their cords from us. He that sitteth in the heavens shall laugh: the Lord shall have them in 44derision” (Psalm 2:1-4). Isaiah 54:17 says, “No weapon that is formed against thee shall prosper....” The Lord Jesus said in Matthew 16:18, “…I will build my church; and the gates of hell shall not prevail against it.” The Church is marching on, and there’s no force on earth or from hell that can prevail against it. As long as we keep the fight on, on our knees, we’re unstoppable. That’s our strategy, our strength and our advantage. When opposition arises, we don’t worry or give in to fear. Through prayer, we receive divine wisdom, insight, and solutions. We’re strengthened with might by God's Spirit in our inner being. In these last days, preach the Gospel without holding back. Remember, this year, we’re completing the full preaching of the Gospel to all nations. We’re doing it with confidence, in the demonstration of the Spirit and power, nothing, and no man forbidding us.",
    "prayer": " Dear Father, thank you for the privilege, opportunities, grace and power to preach the Gospel undeterred, with boldness and faith, in the demonstration of the Spirit and power. Your Word prevails in the nations of the earth and righteousness rains upon all their inhabitants. Your children are full of joy as they preach the Gospel around the world today, for the salvation of many, in Jesus’ Name. Amen.",
    "further_study": " Isaiah 54:17 AMPC; Acts 26:14; Acts 2:44-47",
    "bible_reading_plan": {
      "1_year_plan": " 1 Corinthians 5 & Psalms 117-118",
      "2_year_plan": "Luke 17:31-37 & 1 Samuel 5-6"
    }
  },
  {
    "date": "August 21",
    "topic": "BE COMPLETELY YIELDED TO HIM",
    "memory_verse": "For the prophecy came not in old time by the will of man: but holy men of God spake as they were moved by the Holy Ghost (2 Peter 1:21).",
    "body_text": " When you yield to the Holy Spirit, He stirs you up; He directs your actions and words. I remember the first time I experienced something like that. I had just returned home after receiving the Holy Spirit, and later that day we gathered for our usual family devotion. It followed the familiar routine where each person would read a verse of scripture, and then my dad would lead the prayer or assign any one of us to do so. That day, after we had each read the Scriptures, my dad turned to me and asked me to lead the prayer. As I opened my mouth to pray, I instantly burst forth speaking in tongues. It was loud and fast. I was overwhelmed by the Spirit, and I began to prophesy. That had never happened during our family prayer times. On another occasion, I was sitting in the back of the main church, a young teenager at the time, but I felt the Spirit of God ignite a fire within me as the meeting was going on. Before I knew it, He set me on my feet and I began speaking in tongues and prophesying. The whole church went quiet, but everyone was inspired and edified. When I was done, the senior pastor led the whole congregation into a session of intense prayers. 46There’re moments like that when the Spirit of God moves you. The Prophet Ezekiel said, “Then the spirit entered into me, and set me upon my feet…” (Ezekiel 3:24). You can experience such glorious moments with the Holy Spirit every day; the key is being yielded to Him. His f ire in you is ever glowing. He’s in you and with you forever. He said in Hebrews 13:5, “…I will never leave thee, nor forsake thee.” Then in Matthew 28:20 (NKJV), He said, “…lo, I am with you always, even to the end of the age. Amen.” All the while you had the urge and then went ahead to visit hospitals, prisons, the marketplaces of life to preach, it was the Holy Spirit stirring you. He was the one guiding your steps. When you felt compelled to witness to your classmates, your neighbours, colleagues at work, family members and even strangers you met on the way, it was the Holy Spirit stirring you. This is His ministry in your life today; He empowers you to speak and act according to the Father’s will. As you remain completely yielded to Him, His power and wisdom will be expressed through you. You’re His vessel for the fulfilment of His plans and purposes in the earth.",
    "prayer": " Dear Father, thank you for the Holy Spirit who lives in me and moves me to speak your words with boldness and power. I’m always yielded to your guidance and divine inspiration, stirred always to fulfil your perfect will and my calling in Christ, in Jesus’ Name. Amen.",
    "further_study": " Ezekiel 2:1-2; Jeremiah 20:9; Acts 1:8 AMPC",
    "bible_reading_plan": {
      "1_year_plan": "1 Corinthians 6 & Psalms 119:1-112",
      "2_year_plan": " Luke 18:1-8 & 1 Samuel 7-8"
    }
  },
  {
    "date": "August 22",
    "topic": "UNDERSTANDING THE HUMAN SPIRIT",
    "memory_verse": " And the very God of peace sanctify you wholly; and I pray God your whole spirit and soul and body be preserved blameless unto the coming of our Lord Jesus Christ (1 Thessalonians 5:23).",
    "body_text": " Some people often use the expression “the subconscious mind” when referring to the human spirit. But for those who think of the metaphysical conceptions of life, the subconscious mind is much more than a state where a person is only partially conscious. Rather, it refers to another side of the unexplored or inexplorable human nature. The truth is, when you analyze their descriptions of the subconscious state, they’re actually referring to the human spirit. In 2 Corinthians 4:16, for example, Paul calls it the inward man: \"For which cause we faint not; but though our outward man perish, yet the inward man is renewed day by day.\" The apostle Peter in his f irst epistle calls it the hidden man of the heart: “But let it be the hidden man of the heart, in that which is not corruptible, even the ornament of a meek and quiet spirit, which is in the sight of God of great price” (1 Peter 3:4). Those who lack a proper understanding of the true nature of man refer to the human spirit as the \"subconscious mind.\" The Bible doesn’t talk about a subconscious mind; rather, it reveals the threefold nature of man—spirit, soul, and body. As you study the Scriptures, you’ll see that on one hand, the spirit and soul are used synonymously, referring to the inward man—the unseen, hidden man within the veil of the body. However, in a more specific sense, the terms spirit and soul are distinct. The spirit refers to the actual inward man, while the soul is a tool of the spirit. The soul is to the spirit what the brain is to the body. The human spirit perceives and interacts with the world through his soul. The soul houses the spiritual senses of the inward man, enabling him to relate to both spiritual and natural realities. In essence, the human spirit is the core of your being— that’s the real you—where God lives.",
    "prayer": " Dear Father, thank you for the understanding of my true nature in Christ. My spirit is alive to you, and through my soul, I express the realities of your divine life within me. I walk in the consciousness of my divine nature, fulfilling your purpose for my life, in Jesus' Name. Amen.",
    "further_study": " Proverbs 20:27; Job 32:8; 1 Thessalonians 5:23",
    "bible_reading_plan": {
      "1_year_plan": "1 Corinthians 7 & Psalms 119:113-176",
      "2_year_plan": "Luke 18:9-17 & 1 Samuel 9"
    }
  },
  {
    "date": "August 23",
    "topic": " THE KEY IS TRAINING THE HUMAN SPIRIT",
    "memory_verse": "For bodily exercise profiteth little: but godliness is profitable unto all things, having promise of the life that now is, and of that which is to come (1 Timothy 4:8).",
    "body_text": " There's a phenomenon known as deja vu, the feeling, sense or consciousness that something that's happening has been experienced or seen before. You might have experienced such a thing at one time or the other; it just lends credence to the fact that man is a spirit. When something happens and you feel like you’ve seen or experienced it before, it’s because your spirit was truly involved in the experience even though you’re not able to tell when. It might have either been through a trance, vision, or even as low as a dream. Many have been trying to explore this, wondering if such experiences are even real. Well, the human spirit does have its own activities and they can happen whether you’re awake or asleep, conscious, unconscious or subconscious. How do you take advantage of that? It’s by training and educating your 50human spirit through deep study, meditating, and acting on the Word. Your involvement in church, learning God’s Word in your cell and fellowship groups, attending services, and studying Rhapsody of Realities all contribute to the training of your spirit. But you can accelerate the process by deliberately studying God’s Word and putting it to work. James 1:22 & 25 says, \"But be ye doers of the word, and not hearers only, deceiving your own selves.\" \"But whoso looketh into the perfect law of liberty, and continueth therein, he being not a forgetful hearer, but a doer of the work, this man shall be blessed in his deed.\" As you act on the Word, your spirit is trained, your understanding is sharpened, and you become more attuned to spiritual realities.",
    "prayer": " My spirit is attuned to spiritual realities, being enlightened by God’s Word. I grow in wisdom and walk in greater spiritual awareness. I refuse to be limited by human reasoning, for I function with the mind of Christ. Thank you, heavenly Father, for the light of your Word in my life, in Jesus' Name. Amen.",
    "further_study": "1 Corinthians 2:12-14; Joshua 1:8; James 1:22-25",
    "bible_reading_plan": {
      "1_year_plan": "1 Corinthians 8 & Psalms 120-127",
      "2_year_plan": "Luke 18:18-27 & 1 Samuel 10"
    }
  },
  {
    "date": "August 24",
    "topic": "PRAYING WITH GROANINGS AND DEEP SIGHS",
    "memory_verse": "Likewise the Spirit also helpeth our infirmities: for we know not what we should pray for as we ought: but the Spirit itself maketh intercession for us with groanings which cannot be uttered (Romans 8:26).",
    "body_text": " When we speak in tongues, we do so by faith. We open our mouths and the Holy Spirit gives us utterance. Here, your spirit is praying in tongues. The Bible says, “For if I pray in an unknown tongue, my spirit prayeth, but my understanding is unfruitful” (1 Corinthians 14:14). So, it’s your spirit that prays in tongues even though the utterance is granted to your spirit by the Holy Spirit. But there's another one that's a higher level of prayer. That’s what is written for us in Romans 8:26 which we read as our opening scripture. The underlined phrase \"... the Spirit also helpeth our infirmities...\" tells us how the Spirit helps and takes hold together with us in our weakness. He props you up and helps you pray in line with the perfect will of God especially when you face dire situations and are at your wit's end. He takes over and helps you pray correctly. 52The AMPC puts it beautifully. It says, “So too the [Holy] Spirit comes to our aid and bears us up in our weakness; for we do not know what prayer to offer nor how to offer it worthily as we ought, but the Spirit Himself goes to meet our supplication and pleads in our behalf with unspeakable yearnings and groanings too deep for utterance.” At this higher level of prayer, the Holy Spirit Himself has taken over, making intercessions with groanings and deep sighs according to the will of God. You may find yourself crying uncontrollably but not out of pain; keep at it and don’t be troubled. It’s the Holy Spirit praying through you. This is the most effective kind of prayer, and it’s the Spirit’s joy to make it happen for you. So, each time you pray, yield yourself to the Holy Spirit to pray through you, and you’ll be amazed at the impact and the tremendous results in your life and circumstances. Hallelujah!",
    "prayer": " Dear Father, thank you for the ministry of the Holy Spirit who helps me in prayer. I yield myself completely to Him to intercede through me with groanings and deep sighs, causing your perfect will to be established in my life and in the lives of others. I walk in the light of your Word, always led by the Spirit, in Jesus' Name. Amen.",
    "further_study": "1 Corinthians 14:14 AMPC; Jude 1:20; John 14:16-17",
    "bible_reading_plan": {
      "1_year_plan": "1 Corinthians 9 & Psalms 128-134",
      "2_year_plan": "Luke 18:28-34 & 1 Samuel 11-12"
    }
  },
  {
    "date": "August 25",
    "topic": "ORDAINED TO REIGN",
    "memory_verse": " But ye are a chosen generation, a royal priesthood, an holy nation, a peculiar people; that ye should shew forth the praises of him who hath called you out of darkness into his marvellous light (1 Peter 2:9).",
    "body_text": "As Christians, we live the life of victory in Christ Jesus. This isn’t something we strive for; it’s our heritage. We’re kings and priests, ordained to reign in life. However, not all have come to this understanding. You must train yourself to think, talk, and function with the mindset of a reigning king-priest because that’s who you truly are. You have the dominion. Kings reign. They don’t beg. They exercise authority. This should be your consciousness every day. Don’t struggle to be successful or to prosper; you’ve been made a joint-heir with Christ. Everything you do should reflect kingly glory and excellence. Read our opening scripture in the Amplified Classic; embrace it and walk accordingly. It says, \"But you are a chosen race, a royal priesthood, a dedicated nation, [God's] own purchased, special people, that you may set forth the wonderful deeds and display the virtues and perfections of Him Who called you out of darkness 54into His marvelous light.\" Sadly, some live far below their calling because they haven’t renewed their minds to this truth. They speak the language of failure and act like mere men, not realizing they are royalty. Carry yourself with dignity, authority, and dominion. Walk with confidence because you know your words carry power. Ecclesiastes 8:4 says, \"Where the word of a king is, there is power....\" Romans 5:17, AMPC says, \"…those who receive [God’s] overflowing grace (unmerited favor) and the free gift of righteousness [putting them into right standing with Himself] reign as kings in life through the one Man Jesus Christ (the Messiah, the Anointed One).” If this hasn’t been your mindset, change it today. Declare, \"I am a king-priest in Christ! I walk in dominion, I reign in life, and I display the virtues of my heavenly Father!\" This is your heritage. This is your life in Christ.",
    "prayer": " Dear Father, thank you for calling me into a life of victory, excellence and dominion. I am a king-priest, called to reign in life and display your perfections. My words carry power, and I walk in the consciousness of my divine authority. Thank you for this glorious life, in Jesus' Name. Amen.",
    "further_study": " Revelation 1:6; Revelation 5:10; 1 Peter 2:9 AMPC; Job 22:28",
    "bible_reading_plan": {
      "1_year_plan": "1 Corinthians 10:1-13 & Psalms 135-138",
      "2_year_plan": "Luke 18:35-43 & 1 Samuel 13"
    }
  },
  {
    "date": "August 26",
    "topic": "THE BLUEPRINT FOR A QUIET AND PEACEABLE LIFE",
    "memory_verse": " I exhort therefore, that, first of all, supplications, prayers, intercessions, and giving of thanks, be made for all men; For kings, and for all that are in authority; that we may lead a quiet and peaceable life in all godliness and honesty. For this is good and acceptable in the sight of God our Saviour; who will have all men to be saved, and to come unto the knowledge of the truth (1 Timothy 2:1-4).",
    "body_text": " For us to enjoy peace and prosperity in all godliness and honesty in our societies, the Word of God shows us what to do. We must pray as outlined for us in our opening scripture above. When we do, we will witness the salvation of leaders, heads of institutions, and those in positions of authority. Consequently, the nations will flourish with prosperity and peace. The Holy Spirit, the Chief Strategist, knows exactly how to influence things along these lines. He knows how to convict the leaders, bring them into the Kingdom and cause them to do the right things. Imagine the impact when you intercede for your city, for institutions, 56the president and his cabinet members, state governors, legislators, commissioners, justices of the Supreme Court, judges, etc. It’ll result in a great harvest because it’s God's plan. Don't let anyone convince you that we’re praying too much for the nations. Our prayers are shaping destinies and bringing God's will to pass. This is God’s blueprint for a quiet and peaceable life, not one achieved by chance or political reforms but by the deliberate prayers of Christians who believe and know the truth. So, take your place in intercession. Become the channel for God’s righteousness, peace and prosperity to permeate your city as the Gospel thrives and the will of God is established in the hearts of men. Hallelujah!",
    "prayer": " Dear Father, thank you for showing me how to pray effectively. I take my place in prayer, interceding for all men, for leaders and those in authority, that they may be saved and come to the knowledge of the truth. I declare that the Gospel has free course in the nations and the hearts of men are turned to righteousness. Thank you for the great harvest of souls, in Jesus' Name. Amen.",
    "further_study": "Jeremiah 29:7; Luke 18:1; 1 Timothy 2:1-4 NIV",
    "bible_reading_plan": {
      "1_year_plan": "1 Corinthians 10:14-11:1 & Psalms 139-141",
      "2_year_plan": "Luke 19:1-10 & 1 Samuel 14"
    }
  },
  {
    "date": "August 27",
    "topic": "CONTEND FOR THEIR SOULS",
    "memory_verse": " Epaphras, who is one of you, a servant of Christ, saluteth you, always labouring fervently for you in prayers, that ye may stand perfect and complete in all the will of God (Colossians 4:12)",
    "body_text": " What do you do when you observe people in church who aren’t living right or who don’t come to church anymore? Rather than lament the situation or become judgemental of them, intercede in prayer for them until they are restored. Contend for their souls in prayer. Every soul is valuable to God, and the Bible says His desire is for all to be saved and come to the knowledge of the truth. It’s part of the reasons pastors and leaders should be careful how they treat and handle those who come to church. Some can be harsh and don’t mind doing things that drive people out of the church. But when you’re a true soul winner, you’re different, because you understand what it takes to win even one soul and will do everything it takes to keep them retained. 58Many times, I’ve cried over a soul; I kept interceding until the person came to Christ or was restored back in the Faith. This is why we must pray ahead, at the right time, in the right way, and for the right things. When we do that, we win. Churches must prioritize time for intercessory prayer. Epaphras, in our opening scripture, wasn’t praying for his own needs; he was praying for others. He was an intercessor. He was already walking in the glory of God, but he was praying for others to walk in it as well, to come into the fullness of God’s plan for their lives. This is what you must do every day as well. Intercede for others, for the eyes of their understanding to be opened to the realities of God’s Kingdom and be filled with the knowledge of His will in all wisdom and spiritual understanding. Hallelujah!",
    "prayer": " Dear Father, I pray for those who have strayed from the truth, that they’d be restored quickly, and that their affections will be on the things of the Spirit, never languid or dull, but fervent in spirit, serving you wholeheartedly, in Jesus' Name. Amen.",
    "further_study": "James 5:16; 1 Timothy 2:1; Ephesians 3:14-19",
    "bible_reading_plan": {
      "1_year_plan": "1 Corinthians 11:2-34 & Psalms 142-145",
      "2_year_plan": "Luke 19:11-19 & 1 Samuel 15"
    }
  },
  {
    "date": "August 28",
    "topic": "USE THE SHIELD OF FAITH",
    "memory_verse": "Above all, taking the shield of faith, wherewith ye shall be able to quench all the fiery darts of the wicked (Ephesians 6:16).",
    "body_text": " There are times when troubling thoughts may run through the mind, creating feelings of distress and agitation. Some people think they’re just being emotional when this happens. But what they don’t realize is that the enemy often seeks to take advantage of their emotions by bombarding their minds with negative thoughts. These are f iery darts and missiles. When such negative emotions, resulting from negative thoughts are left unchecked, they could soon lead to anxiety and despondency. These are signs that the adversary is attempting to create turmoil through the mind. But Ephesians 6:16 says, \"Above all, taking the shield of faith, wherewith ye shall be able to quench all the f iery darts of the wicked.\" At such moments when you find yourself wrestling with thoughts of gloom, use your shield of faith. Actively vocalize the Word of God. Remember, faith must be vocalized and put to work. You ought to declare, “I refuse to be anxious, fretful, nervous or apprehensive. I’m born of God and have overcome Satan, the world and its negative and debilitating effects.” If you don’t actively use your faith against the missiles the enemy throws at your mind, the attacks may extend 60from the mind to the body. It’s the reason you must be quick to use the Word to cut out and expel all negative thoughts and wicked imaginations. Declare that your spirit, soul, body and mind belong to the Lord and are thus sanctified by the Spirit. Your bold, faith-filled declarations put you over and above every assault of the adversary. The shield of faith quenches all the fiery darts of the wicked. Henceforth, if terrible thoughts come to your mind or something unusual appears in your body, maybe it’s a swelling, a hardening or any abnormality, kill it with your faith-filled words. Your words are not ordinary. The Bible talks about the sword of the Spirit, which is the Word or “Rhema” (Greek) of God (Ephesians 6:17). “Rhema” is the spoken Word, the Word of God that you speak forth. So, when you face challenges, refuse to fret or be moved; rather, declare your victory in Christ. 2 Corinthians 2:14 says “Now thanks be unto God, which always causeth us to triumph in Christ….” This is the victorious life in Christ; we use the Word against the enemy. We’re triumphant by the Spirit through our faith-filled words. Glory to God!",
    "prayer": "Dear Father, thank you for the shield of faith by which I quench every fiery dart of the enemy. I’m triumphant by the Spirit through my faith-filled confessions. I’m sanctified and vitalized to walk in victory, strength and divine health, in Jesus’ Name. Amen.",
    "further_study": " 2 Corinthians 10:4-5; Proverbs 4:20-23; Ephesians 6:13-18",
    "bible_reading_plan": {
      "1_year_plan": "1 Corinthians 12 & Psalms 146-150",
      "2_year_plan": "Luke 19:20-27 & 1 Samuel 16"
    }
  },
  {
    "date": "August 29",
    "topic": "KEEP BUILDING AND USING YOUR FAITH",
    "memory_verse": " But ye, beloved, building up yourselves on your most holy faith, praying in the Holy Ghost (Jude 1:20).",
    "body_text": " Faith, like fire, has a natural tendency to dissipate if it’s not sustained. Fire consumes its source, and if you don’t keep feeding it, it eventually goes out. It’s the same with faith. You’re responsible for building your faith; feed it for it to grow, and constantly use it for it to remain strong. You feed your faith by hearing and receiving more of God’s Word into your spirit, for faith comes by hearing (Romans 10:17). But you build your faith strong by putting it to work, by using it. So, to sustain the fire of your faith, you have to keep adding more “material,” that is, more of God’s Word. You must keep feeding your spirit with the Word. Your faith shouldn’t remain at one level; our opening scripture talks about building up yourself on your most holy faith. The Amplified Classic renders it thus, “But you, beloved, build yourselves up [founded] on your most holy faith [make progress, rise like an edifice higher 62and higher], praying in the Holy Spirit.” This means the highest level of faith you may have attained isn’t the end; you have to keep building on it. Don’t let your journey of faith become a mere memory of how you once walked in great faith. No! Remember, the Christian life is from glory to glory, grace to grace, and faith to faith—ever-increasing faith! Growing in Christ means your faith gets stronger; you have the faith of the fathers; faith that’s deep, tested, proven and victorious through trials; faith that always prevails. Hallelujah!",
    "prayer": " My faith is strong and always prevails because I put it to work and feed it always with the Word. I walk in perpetual victory. Thank you, heavenly Father, for even now, I build myself on my most holy faith as I pray in the Holy Ghost. Amen.",
    "further_study": "Romans 10:17; Acts 20:32; James 2:18-26",
    "bible_reading_plan": {
      "1_year_plan": "1 Corinthians 13, Proverbs 1-2",
      "2_year_plan": "Luke 19:28-40 & 1 Samuel 17"
    }
  },
  {
    "date": "August 30",
    "topic": "YOU HAVE A NEW LIFE AND A NEW NATURE",
    "memory_verse": "But we know that the law is good, if a man use it lawfully; Knowing this, that the law is not made for a righteous man… (1 Timothy 1:8-9).",
    "body_text": " Did you ever read in the Bible that the Law and its ordinances were abolished? Ephesians 2:15 says, “Having abolished in his flesh the enmity, even the law of commandments contained in ordinances; for to make in himself of twain one new man, so making peace.” Therefore, having become a Christian, the commandments, \"Thou shalt not steal\" or \"Thou shalt not kill,\" etc., no longer apply. Does that mean you can steal? No, and a thousand times, no! The reason they don’t apply isn’t because stealing and murder are permitted. Rather, it’s because in Christ, you have a new life, a new nature that doesn’t steal or kill. You’re of a higher class. 1 Corinthians 6:11 says, “… but ye are washed, but ye are sanctified, but ye are justified in the name of the Lord Jesus, and by the Spirit of our God.” Consider what we read in our opening scripture: The law isn’t made for the righteous. In Christ, you’re the righteousness of God; therefore, the Law isn’t for you. The Law was for the children of Israel, which they couldn’t keep. They saw the commandments as laws to be obeyed and 64not as life. But the Word of God is life, and in Christianity, we live the Word because we’re born of the Word. We have the life of the Word.  For example, when the Lord Jesus said, “Man shall not live by bread alone, but by every word of God,” He wasn’t trying to obey it; He was describing His righteous nature. Also, when He said, “Thou shalt not tempt the Lord thy God,” it was a description of His identity. Likewise, when you read, “Thou shall not kill” or “Thou shall not steal,” it’s the description of your righteous nature. Being born again, you’re righteous and holy; therefore, it’s inconsistent with your nature to steal or to kill. It’s like what the Bible says in Colossians 3:9-10: “Lie not one to another, seeing that ye have put off the old man with his deeds; And have put on the new man, which is renewed in knowledge after the image of him that created him.” The reason it says don’t tell lies is because of who you are. You’re born of God, and the Spirit of truth lives in you. Glory to God! You have a new nature that’s created after God in righteousness and true holiness.",
    "prayer": " Dear Father, thank you for making me righteous in Christ Jesus. I walk in the light of who I am in Christ. I'm governed by the law of the Spirit of life in Christ Jesus. I walk in righteousness, and I manifest the character of Christ effortlessly. Amen.",
    "further_study": " Ephesians 4:20-24; 2 Corinthians 5:17 & 21; Romans 6:4",
    "bible_reading_plan": {
      "1_year_plan": "1 Corinthians 14 & Proverbs 3-4",
      "2_year_plan": "Luke 19:41-48 & 1 Samuel 18"
    }
  },
  {
    "date": "August 31",
    "topic": "GOD IN HUMAN FORM",
    "memory_verse": "Declared to be the Son of God with power, according to the spirit of holiness, by the resurrection from the dead (Romans 1:4).",
    "body_text": " The Bible tells us that Jesus Christ is the Son of God. Now, that is an extraordinary statement because Jesus said so Himself, and when others referred to Him as the Son of God, He didn't deny; He affirmed it. But what does \"Son of God\" actually mean? I’ve explained it several times, but it bears repeating.  Son of God doesn't mean someone born by God in a literal sense. \"Son of God\" means God in human flesh. So, when Jesus said He was the Son of God, the Jewish people around him understood exactly what He meant. They were angry because they recognized that \"Son of God\" signifies God becoming a human being. Therefore, they accused Jesus of blasphemy, saying, \"You, being a man, make yourself equal with God.\" But that’s precisely who Jesus is, and His resurrection from the dead proves it. God became a man, took on flesh and lived among us to save us, that we might also become sons of God: “But as many as received him, to them gave he power to become the sons of God, even to them that believe on his name: Which were born, not of blood, nor of the will of the flesh, nor of the will of man, but of God” (John 1:12-13). He brought us salvation and eternal life so that we can live like Him and be in fellowship with God. Now we can relate to God as His beloved children. We can talk to Him and He talks to us. He brought us into His class. He’s made us like Himself. 1 John 4:17 says, “...as He is, so are we in this world.” Now we too have become sons of God: “Behold, what manner of love the Father hath bestowed upon us, that we should be called the sons of God…” (1 John 3:1). Hallelujah!",
    "prayer": " Dear Father, thank you for the revelation of Jesus Christ as the Son of God. He is God manifested in human flesh, and through His resurrection, you gave me eternal life and union with you. I live in the consciousness of this divine relationship, walking in bold fellowship and communion with you, in Jesus’ Name. Amen.",
    "further_study": " John 1:14; John 10:30-36; 1 Timothy 3:16",
    "bible_reading_plan": {
      "1_year_plan": "1 Corinthians 15:1-34 & Proverbs 5-7",
      "2_year_plan": "Luke 20:1-8 & 1 Samuel 19"
    }
  }
]